-- -*- M2-comint -*- hash: 48356993

i1 : T=(tabFromPar(makePar{{2,1},{},{1},{}},NST=>true,Entries=>{{0,1,2},{},{3},{}})) # 0

o1 = {| 0 1 |, -, | 3 |, -}
      | 2 |

o1 : mTableaux

i2 : S=(tabFromPar(makePar{{2,1},{},{1},{}},NST=>true,Entries=>{{0,1,2},{},{3},{}})) # 1

o2 = {| 0 2 |, -, | 3 |, -}
      | 1 |

o2 : mTableaux

i3 : F=HSP(QQ[x1,x2,x3,x4],4,1)

o3 = Higher Specht Polynomials over G(4,1,4) of type F

o3 : HigherSpechtPolynomial

i4 : F^T

o4 = ({{| 0 2 |, -, | 3 |, -}, {| 0 1 |, -, | 3 |, -}, {| 0 3 |, -, | 2 |,
        | 1 |                   | 2 |                   | 1 |             
     ------------------------------------------------------------------------
     -}, {| 0 3 |, -, | 1 |, -}, {| 1 3 |, -, | 0 |, -}, {| 0 1 |, -, | 2 |,
          | 2 |                   | 2 |                   | 3 |             
     ------------------------------------------------------------------------
     -}, {| 0 2 |, -, | 1 |, -}, {| 1 2 |, -, | 0 |, -}}, {- 2x1*x4 + 2x2*x4,
          | 3 |                   | 3 |
     ------------------------------------------------------------------------
     - 2x1*x4 + 2x3*x4, - 2x1*x3 + 2x2*x3, - 2x1*x2 + 2x2*x3, - 2x1*x2 +
     ------------------------------------------------------------------------
     2x1*x3, - 2x1*x3 + 2x3*x4, - 2x1*x2 + 2x2*x4, - 2x1*x2 + 2x1*x4})

o4 : Sequence

i5 : F_S

                                                                          
o5 = ({{| 0 1 |, -, | 2 |, -}, {| 0 3 |, -, | 1 |, -}, {| 0 1 |, -, | 3 |,
        | 3 |                   | 2 |                   | 2 |             
     ------------------------------------------------------------------------
                                                                            
     -}, {| 0 2 |, -, | 1 |, -}, {| 0 2 |, -, | 3 |, -}, {| 1 2 |, -, | 0 |,
          | 3 |                   | 1 |                   | 3 |             
     ------------------------------------------------------------------------
                                                                         
     -}, {| 0 3 |, -, | 2 |, -}, {| 1 3 |, -, | 0 |, -}}, {- 2x1 + 2x2, -
          | 1 |                   | 2 |
     ------------------------------------------------------------------------
                                           2          2     2       2     
     x1*x3 + x2*x3, - 2x1*x4 + 2x2*x4, - x1 x2 + x1*x2  - x1 x3 + x2 x3, -
     ------------------------------------------------------------------------
                               2              2      2             2    
     x1*x3*x4 + x2*x3*x4, - 2x1 x2*x3 + 2x1*x2 x3, x1 x2*x4 - x1*x2 x4 -
     ------------------------------------------------------------------------
          2          2        2     2        2  2
     x1*x3 x4 + x2*x3 x4, - x1 x2*x3  + x1*x2 x3 })

o5 : Sequence

i6 : H=HSP(QQ[x1,x2],3,2)

o6 = Higher Specht Polynomials over G(3,1,2) of type H

o6 : HigherSpechtPolynomial

i7 : P=makePar({{},{1},{},{1}})

o7 = {Partition{}, Partition{1}, Partition{}, Partition{1}}

o7 : List

i8 : H^P

o8 = ({{{-, | 1 |, -, | 0 |}, {-, | 1 |, -, | 0 |}}, {{-, | 0 |, -, | 1 |},
     ------------------------------------------------------------------------
     {-, | 0 |, -, | 1 |}}, {{-, | 0 |, -, | 1 |}, {-, | 1 |, -, | 0 |}},
     ------------------------------------------------------------------------
     {{-, | 1 |, -, | 0 |}, {-, | 0 |, -, | 1 |}}}, {1, x1, 1, x2})

o8 : Sequence

i9 : H_P

o9 = ({{{-, | 0 |, -, | 1 |}, {-, | 1 |, -, | 0 |}}, {{-, | 0 |, -, | 1 |},
     ------------------------------------------------------------------------
     {-, | 0 |, -, | 1 |}}}, {1, x1})

o9 : Sequence

i10 : 
